# dev
brew "autojump"
brew "tmux"
brew "tree"
brew "nmap"
brew "nvm"
brew "python@3.11"
brew "neovim"
brew "curl"
brew "gh"
# brew "erlang"
# brew "elixir"
# brew "go"
# brew "python@3.10"
tap "homebrew/cask-fonts"
brew "font-hack-nerd-font"
brew "pandoc"
cask "iterm2"
cask "visual-studio-code"
tap "jkfran/killport"
brew "jkfran/killport/killport"
cask "hyper"
cask "tableplus"
cask "transmit"
cask "tunnelblick"

# killer app
cask "alfred"
cask "obsidian"
cask "karabiner-elements"
cask "keyboard-maestro"
cask "popclip"
cask "1password-cli"
cask "1password"

# cask
cask "bartender"
cask "google-chrome"
cask "keka"
cask "slack"
cask "docker"
cask "syncthing"
cask "telegram"
cask "mimestream"
tap "1password/tap"

# mas
mas "Amphetamine", id: 937984704
mas "Checkor", id: 1238750814
mas "ColorSlurp", id: 1287239339
mas "Keystroke Pro", id: 1572206224
mas "Magnet", id: 441258766
mas "WireGuard", id: 1451685025
mas "Unsplash Wallpapers", id: 1284863847
mas "Yoink", id: 457622435
mas "Mirror Magnet", id: 1563698880
mas "KakaoTalk", id: 869223134
mas "Calendar 366 II", id: 1265895169
