
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "1password/tap"
tap "jkfran/killport"

cask "1password-cli"
cask "1password"
brew "jkfran/killport/killport"

brew "autojump"
cask "iterm2"
cask "visual-studio-code"
brew "tmux"
brew "tree"
brew "nmap"
brew "nvm"
brew "python@3.11"
brew "neovim"
brew "curl"
brew "gh"
# brew "erlang"
# brew "elixir"
# brew "go"
# brew "python@3.10"

brew "pandoc"
cask "alfred"
cask "obsidian"
cask "bartender"
cask "google-chrome"
cask "karabiner-elements"
cask "keyboard-maestro"
cask "keka"
cask "popclip"
cask "tableplus"
cask "telegram"
cask "transmit"
cask "tunnelblick"
cask "slack"
cask "docker"


# mas
mas "Amphetamine", 937984704
mas "Checker", 1238750814
mas "ColorSlurp", 1287239339
mas "Keystroke Pro", 1572206224
mas "Magnet", 441258766
mas "WireGuard", 1451685025
mas "Unsplash Wallpapers", 1284863847
mas "Yoink", 457622435
mas "Mirror Magnet", 1563698880
