# backup
cask "syncthing"
cask "docker"

# ai
cask "chatgpt"

# dev
brew "tmux"
brew "tree"
brew "nmap"
brew "nvm"
brew "python@3.11"
brew "neovim"
brew "curl"
# brew "erlang"
# brew "elixir"
# brew "go"
cask "font-hack-nerd-font"
cask "iterm2"
cask "cursor"
  # cask "visual-studio-code"
cask font-ibm-plex-sans
cask font-ibm-plex-mono
tap "jkfran/killport"
brew "jkfran/killport/killport"
cask "tableplus"
# cask "transmit"
brew "ccat"
brew "zoxide"

# cask
## killer 프로그램
cask "alfred"
cask "notion"
  # cask "obsidian"
cask "karabiner-elements"
cask "keyboard-maestro"
cask "popclip"
## 유틸 프로그램
cask "choosy"
cask "jordanbaird-ice"
  # cask "bartender"
cask "1password-cli"
cask "1password"
cask "chatgpt"
cask "devtoys"
cask "google-chrome"
cask "keka"
cask "slack"
cask "telegram"
cask "iina"
cask "linearmouse"
cask "bettertouchtool"

cask "spotify"
cask "notion"
cask "shottr"

# mas
mas "Amphetamine", id: 937984704
mas "ColorSlurp", id: 1287239339
mas "Keystroke Pro", id: 1572206224
mas "Magnet", id: 441258766
mas "WireGuard", id: 1451685025
mas "Unsplash Wallpapers", id: 1284863847
mas "Mirror Magnet", id: 1563698880
mas "KakaoTalk", id: 869223134
mas "Calendar 366 II", id: 1265895169
mas "PDF Expert - Editor and Reader", id: 743974925
mas "Dropover - Easier Drag & Drop", id: 1355679052
mas "PDF Expert - Editor and Reader", id: 743974925
mas "Microsoft Excel", id: 586683407
